In [ ]:
import pandas as pd
import numpy as np

In [25]:
dic = {'Ling':99, 'Mo':27, 'Yu':32}
pdarr2 = pd.Series(data=dic, dtype=float)

In [29]:
pdarr2.reindex(index=['Np', 'Ling', 'Hlh'], fill_value='补全值')

Np       补全值
Ling    99.0
Hlh      补全值
dtype: object

In [ ]:
'''
dtype 类型
size  数组长
empty 是否为空
name  名字
方法
head(返回数据的行数)
isnull(是否有缺失值)

'''

In [41]:
arr3 = np.random.randn(6)
pdarr3 = pd.Series(data = arr3)

In [42]:
pdarr3.head(5)

0    0.826544
1    1.288712
2   -0.275998
3    0.248512
4    1.022553
dtype: float64

In [52]:
arr1[arr1<5]

array([2, 3, 4, 0])

In [70]:
# 二维数据
N = 9
M = 6
rarr1 = [np.random.randn(N) for _ in range(M)]
pdarr4 = pd.DataFrame(rarr1).T

In [76]:
pdarr4[pdarr4<0].isna().sum()

0    5
1    7
2    5
3    4
4    5
5    2
dtype: int64

In [78]:
pdarr4[pdarr4<0].isna()

       0      1      2      3      4      5
0   True   True   True  False  False   True
1  False  False   True   True   True  False
2  False  False  False   True  False  False
3   True   True  False   True  False  False
4   True   True  False  False  False  False
5  False   True   True  False   True  False
6   True   True   True   True   True  False
7  False   True  False  False   True  False
8   True   True   True  False   True   True

In [9]:
data = {'name':['Mo','Ling','Yu'],'age':[16,18,15],'height':[170.0,171.0,165.0]}
df = pd.DataFrame(data=data)
data2 = [['Mo','Ling','Yu'],[16,18,15],[170.0,171.0,165.0]]
df2 = pd.DataFrame(data=data2)

In [13]:
# 列查询
print(df['name'])
# 行查询
print(df[0:2])
print(df[df['height']<170])

0      Mo
1    Ling
2      Yu
Name: name, dtype: object
   name  age  height
0    Mo   16   170.0
1  Ling   18   171.0
  name  age  height
2   Yu   15   165.0

In [10]:
# 行查询
print(df2[0])

0       Mo
1       16
2    170.0
Name: 0, dtype: object

In [14]:
# 添加数据
df['weight'] = pd.Series([70,76,62])
print(df)

   name  age  height  weight
0    Mo   16   170.0      70
1  Ling   18   171.0      76
2    Yu   15   165.0      62

In [15]:
# df.insert(插入位置，插入名字，插入的值)
df.insert(3,'xy',[10.7,6.9,21.7])
print(df)

   name  age  height    xy  weight
0    Mo   16   170.0  10.7      70
1  Ling   18   171.0   6.9      76
2    Yu   15   165.0  21.7      62

In [21]:
df.pop('BMI')
df.insert(5,'BMI',df['weight']/df['height']**2)
print(df)

   name  age  height    xy  weight       BMI
0    Mo   16   170.0  10.7      70  0.002422
1  Ling   18   171.0   6.9      76  0.002599
2    Yu   15   165.0  21.7      62  0.002277

In [2]:
# 行索引
data3 = {'name':['Mo','Ling','Yu'],'age':[16,18,15],'height':[170.0,171.0,165.0]}
df3 = pd.DataFrame(data=data3,index=['p1','p2','p3'])
print(df3)

    name  age  height
p1    Mo   16   170.0
p2  Ling   18   171.0
p3    Yu   15   165.0

In [3]:
print(df3[['age','name']])

    age  name
p1   16    Mo
p2   18  Ling
p3   15    Yu

In [4]:
# print(df3.loc[行数，列数])
print(df3.loc['p2','age'], end='\n\n')
print(df3.loc['p2'], end='\n\n')
print(df3.loc[['p1','p3']], end='\n\n')
print(df3.loc[['p1','p3'],['age']], end='\n\n')

18

name       Ling
age          18
height    171.0
Name: p2, dtype: object

   name  age  height
p1   Mo   16   170.0
p3   Yu   15   165.0

    age
p1   16
p3   15

In [5]:
print(df3.iloc[0], end='\n\n')
print(df3.iloc[:2, :2], end='\n\n')

name         Mo
age          16
height    170.0
Name: p1, dtype: object

    name  age
p1    Mo   16
p2  Ling   18

In [6]:
# 函数
dfT=pd.DataFrame(data=[['Yang',24,173.0],['Zong',61,172.0]]
                 ,columns=['name','age','height']
                 ,index=['p4','p5'])
print(df3._append(dfT))
df3 = df3._append(dfT)

    name  age  height
p1    Mo   16   170.0
p2  Ling   18   171.0
p3    Yu   15   165.0
p4  Yang   24   173.0
p5  Zong   61   172.0

In [7]:
dfX=pd.DataFrame(data=[['Zong',61,172.0,np.nan],['Kong',99,170.0,'X']]
                 ,columns=['name','age','height','K']
                 ,index=['p5','p6'])
print(pd.concat([dfX,df3],join='outer',axis=1,ignore_index=True))

       0     1      2    3     4     5      6
p5  Zong  61.0  172.0  NaN  Zong  61.0  172.0
p6  Kong  99.0  170.0    X   NaN   NaN    NaN
p1   NaN   NaN    NaN  NaN    Mo  16.0  170.0
p2   NaN   NaN    NaN  NaN  Ling  18.0  171.0
p3   NaN   NaN    NaN  NaN    Yu  15.0  165.0
p4   NaN   NaN    NaN  NaN  Yang  24.0  173.0

In [8]:
print(pd.merge(dfX,df3,on='name',how='right'),end='\n\n')
print(pd.merge(dfX,df3,on='name',how='left'),end='\n\n')
print(pd.merge(dfX,df3,on='name',how='inner'),end='\n\n')
print(pd.merge(dfX,df3,on='name',how='outer'),end='\n\n')
df4 = pd.merge(dfX,df3,on='name',how='outer')

   name  age_x  height_x    K  age_y  height_y
0    Mo    NaN       NaN  NaN     16     170.0
1  Ling    NaN       NaN  NaN     18     171.0
2    Yu    NaN       NaN  NaN     15     165.0
3  Yang    NaN       NaN  NaN     24     173.0
4  Zong   61.0     172.0  NaN     61     172.0

   name  age_x  height_x    K  age_y  height_y
0  Zong     61     172.0  NaN   61.0     172.0
1  Kong     99     170.0    X    NaN       NaN

   name  age_x  height_x    K  age_y  height_y
0  Zong     61     172.0  NaN     61     172.0

   name  age_x  height_x    K  age_y  height_y
0  Zong   61.0     172.0  NaN   61.0     172.0
1  Kong   99.0     170.0    X    NaN       NaN
2    Mo    NaN       NaN  NaN   16.0     170.0
3  Ling    NaN       NaN  NaN   18.0     171.0
4    Yu    NaN       NaN  NaN   15.0     165.0
5  Yang    NaN       NaN  NaN   24.0     173.0

In [44]:
# 基础数据
arr1 = np.array([2, 3, 4, 7, 9, 0])
pdarr1 = pd.Series(data=arr1, index=('a','e','u','i','o','e'), dtype=float)

In [117]:
print(df3.drop(columns='name',axis=0))
print(df3.drop(labels='p1',axis=0))
print(df3.drop(index='p1',columns='name',axis=0))

    age  height
p1   16   170.0
p2   18   171.0
p3   15   165.0
p4   24   173.0
p5   61   172.0
    name  age  height
p2  Ling   18   171.0
p3    Yu   15   165.0
p4  Yang   24   173.0
p5  Zong   61   172.0
    age  height
p2   18   171.0
p3   15   165.0
p4   24   173.0
p5   61   172.0

In [134]:
[print(type(i)) for i in df3.dtypes]

<class 'numpy.dtype[object_]'>
<class 'numpy.dtype[int64]'>
<class 'numpy.dtype[float64]'>

[None, None, None]

In [162]:
df3.values[0,0] = np.nan
print(df3)

    name  age  height
p1   NaN   16   170.0
p2  Ling   18   171.0
p3    Yu   15   165.0
p4  Yang   24   173.0
p5  Zong   61   172.0

In [176]:
print(df4)
df4.info()

   name  age_x  height_x    K  age_y  height_y
0  Zong   61.0     172.0  NaN   61.0     172.0
1  Kong   99.0     170.0    X    NaN       NaN
2   NaN    NaN       NaN  NaN   16.0     170.0
3  Ling    NaN       NaN  NaN   18.0     171.0
4    Yu    NaN       NaN  NaN   15.0     165.0
5  Yang    NaN       NaN  NaN   24.0     173.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   age_x     2 non-null      float64
 2   height_x  2 non-null      float64
 3   K         1 non-null      object
 4   age_y     5 non-null      float64
 5   height_y  5 non-null      float64
dtypes: float64(4), object(2)
memory usage: 416.0+ bytes

In [175]:
# 基础数据整合
# 数量
# 平均值
# 标准差
# 最小值
# 不同位置的值大小
# 最大值
# var 方差
# std 标准差
df4.describe(include='all')

        name      age_x    height_x    K      age_y    height_y
count      5   2.000000    2.000000    1   5.000000    5.000000
unique     5        NaN         NaN    1        NaN         NaN
top     Zong        NaN         NaN    X        NaN         NaN
freq       1        NaN         NaN    1        NaN         NaN
mean     NaN  80.000000  171.000000  NaN  26.800000  170.200000
std      NaN  26.870058    1.414214  NaN  19.434505    3.114482
min      NaN  61.000000  170.000000  NaN  15.000000  165.000000
25%      NaN  70.500000  170.500000  NaN  16.000000  170.000000
50%      NaN  80.000000  171.000000  NaN  18.000000  171.000000
75%      NaN  89.500000  171.500000  NaN  24.000000  172.000000
max      NaN  99.000000  172.000000  NaN  61.000000  173.000000

In [191]:
df5 = df4.sample(frac = 1.10,replace=True)
print(df5)

   name  age_x  height_x    K  age_y  height_y
2   NaN    NaN       NaN  NaN   16.0     170.0
0  Zong   61.0     172.0  NaN   61.0     172.0
5  Yang    NaN       NaN  NaN   24.0     173.0
0  Zong   61.0     172.0  NaN   61.0     172.0
4    Yu    NaN       NaN  NaN   15.0     165.0
4    Yu    NaN       NaN  NaN   15.0     165.0
1  Kong   99.0     170.0    X    NaN       NaN

In [220]:
print(df5.drop_duplicates(subset=['K'],keep=False,dropnan=False),end='\n\n')
print(df5.drop_duplicates(subset=['name','K'],keep=False))

TypeError: drop_duplicates() got an unexpected keyword argument 'dropnan'

In [204]:
dic6={
    'company':['A','B','C','C','B','A','B'],
    'salary':[11,13,11,10,17,14,16],
    'age':[21,27,27,23,26,22,29]
}
df6=pd.DataFrame(data=dic6)
print(df6)

  company  salary  age
0       A      11   21
1       B      13   27
2       C      11   27
3       C      10   23
4       B      17   26
5       A      14   22
6       B      16   29

In [227]:
temp1 = df6.groupby(['company'],sort=False,as_index=False)
for i,e in temp1['company']:
    print(i,'\n',e,end='\n')

A
 0    A
5    A
Name: company, dtype: object
B
 1    B
4    B
6    B
Name: company, dtype: object
C
 2    C
3    C
Name: company, dtype: object

In [229]:
temp1['age'].agg(['max','min','mean','var','sum'])

  company  max  min       mean       var  sum
0       A   22   21  21.500000  0.500000   43
1       B   29   26  27.333333  2.333333   82
2       C   27   23  25.000000  8.000000   50

In [242]:
temp2=temp1['age'].transform('mean')
print(temp2)

0    21.500000
1    27.333333
2    25.000000
3    25.000000
4    27.333333
5    21.500000
6    27.333333
Name: age, dtype: float64

In [243]:
df6['mean']=temp2
print(df6)

  company  salary  age       mean
0       A      11   21  21.500000
1       B      13   27  27.333333
2       C      11   27  25.000000
3       C      10   23  25.000000
4       B      17   26  27.333333
5       A      14   22  21.500000
6       B      16   29  27.333333

In [252]:
def seeData(data):
    # by:排序的列名
    # ascending:使用升序排序True/False
    # na_position:last,first,nan值排序的位置
    df=data.sort_values(by='age', ascending=False, na_position='last')
    return df.iloc[0,[0,1]]
    # .iloc[0,:]去除第一列
df6.groupby(['age']).apply(seeData)

    company  salary
age
21        A      11
22        A      14
23        C      10
26        B      17
27        B      13
29        B      16

In [263]:
print(df4[['K','name']],end='\n\n')
print(df4.iloc[2:]['name'])

     K  name
0  NaN  Zong
1    X  Kong
2  NaN   NaN
3  NaN  Ling
4  NaN    Yu
5  NaN  Yang

2     NaN
3    Ling
4      Yu
5    Yang
Name: name, dtype: object

In [271]:
df2[3]=['mi',17,176.0]

In [273]:
df2._append([[5,5,6,5,5]])

       0      1      2      4      3
0     Mo   Ling     Yu   yang     mi
1     16     18     15     16     17
2  170.0  171.0  165.0  188.0  176.0
0      5      5      6      5      5

In [65]:
print(df4,end='\n\n')
print(df4.dropna(axis=0,subset=['age_y']),end='\n\n')
df4[['age_y']].mean(axis=0)
filldict={str(key):df4[key].mean(axis=0) if(np.dtype(df4[key])==np.float64) else np.nan for key in df4.columns}

# filldict={str(key):np.dtype(df4[key])==np.float64 for key in df4.columns}
# filldic={key:df4[key].mean(axis=0) for key in filldic if filldic[key]}

df4.fillna(filldict)
# fillna(method,limit)

   name  age_x  height_x    K  age_y  height_y
0  Zong   61.0     172.0  NaN   61.0     172.0
1  Kong   99.0     170.0    X    NaN       NaN
2    Mo    NaN       NaN  NaN   16.0     170.0
3  Ling    NaN       NaN  NaN   18.0     171.0
4    Yu    NaN       NaN  NaN   15.0     165.0
5  Yang    NaN       NaN  NaN   24.0     173.0

   name  age_x  height_x    K  age_y  height_y
0  Zong   61.0     172.0  NaN   61.0     172.0
2    Mo    NaN       NaN  NaN   16.0     170.0
3  Ling    NaN       NaN  NaN   18.0     171.0
4    Yu    NaN       NaN  NaN   15.0     165.0
5  Yang    NaN       NaN  NaN   24.0     173.0

   name  age_x  height_x    K  age_y  height_y
0  Zong   61.0     172.0  NaN   61.0     172.0
1  Kong   99.0     170.0    X   26.8     170.2
2    Mo   80.0     171.0  NaN   16.0     170.0
3  Ling   80.0     171.0  NaN   18.0     171.0
4    Yu   80.0     171.0  NaN   15.0     165.0
5  Yang   80.0     171.0  NaN   24.0     173.0

In [54]:
99 if (4>99) else 77

77